IDENTIFICATION DIVISION.
PROGRAM-ID. REG-SOLTO.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 CLI-ID    PIC 9(06).
77 CLI-NOME  PIC X(40).
77 CLI-END   PIC X(50).
77 CLI-FONE  PIC X(11).
PROCEDURE DIVISION.
    DISPLAY "SISTEMA SEM ESTRUTURA DE GRUPO".
    STOP RUN.
