IDENTIFICATION DIVISION.
PROGRAM-ID. LABIRINTO.
PROCEDURE DIVISION.
PASSO-1.
    DISPLAY "INICIANDO PROCESSO".
    IF VALOR-OK GO TO PASSO-3.
PASSO-2.
    DISPLAY "CORRIGINDO ERRO".
    GO TO PASSO-4.
PASSO-3.
    DISPLAY "VALOR APROVADO".
    GO TO PASSO-2.
PASSO-4.
    DISPLAY "FIM DO FLUXO".
    STOP RUN.
