IDENTIFICATION DIVISION.
PROGRAM-ID. EX-MALUCO.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 V1 PIC 9(4)V99 VALUE 0.
77 V2 PIC 9(4)V99 VALUE 0.
77 X PIC 9(4)V99 VALUE 0.
77 STR PIC X(30) VALUE SPACES.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "NOME DO CABOCLO:"
    ACCEPT STR
    DISPLAY "QUANTO GANHA:"
    ACCEPT V1
    IF V1 > 5000.00
    COMPUTE V2 = V1 * 0.20
    ELSE
    COMPUTE V2 = V1 * 0.10
    END-IF
    COMPUTE X = V1 - V2
    DISPLAY "RESULTADO:"
    DISPLAY STR
    DISPLAY X
    STOP RUN.
